#+TEMPLATE: NSF Proposal - Biographical sketch
#+key: nsf-proposal-biosketch
#+group: proposal
#+contributor: John Kitchin <jkitchin@andrew.cmu.edu>
#+default-filename: biosketch.org

#+latex_class: cmu-article
#+latex_class_options: [12pt]
# remove spacing in numbered lists
#+latex_header: \usepackage{enumitem}
#+latex_header:   \setlist{nosep} % or \setlist{noitemsep} to leave space around whole list
# remove spacing around section headings
#+latex_header: \usepackage[compact]{titlesec}
#+latex_header: \titleformat{\section}{\normalfont\fontsize{12}{15}\bfseries}{\thesection}{1em}{}
#+latex_header: \renewcommand\thesection{(\alph{section})}
#+options: toc:nil
*Biographical Sketch - John R. Kitchin (jkitchin@andrew.cmu.edu)*\\

* Data					:noexport:

Assuming you have a bibtex file that is up to date, you can extract the authors like this. You will have to do some manual editing to eliminate students and duplicates, and finally to add affiliations.

#+BEGIN_SRC emacs-lisp
(find-file "../../../bibliography/references.bib")

; *BibTeX Search*
(bibtex-display-entries (bibtex-search-entries "author" "kitchin"))
(let ((author-strings '())
      (current-year (string-to-number (format-time-string "%Y")))
      author-string

      year)
  (with-current-buffer "*BibTeX Search*"
    (bibtex-map-entries
     (lambda (a b c)
       (setq year (string-to-number (bibtex-autokey-get-field "year")))
       (setq author-string (replace-regexp-in-string "\n" "" (bibtex-autokey-get-field "author")))
       (setq author-string (replace-regexp-in-string "\\s-+" " " author-string))
       (if (> year (- current-year 5))
	   (loop for author in (s-split " and " author-string)
		 do
		 (add-to-list
		  'author-strings
		  (cond
		   ;; last, first
		   ((string-match "," author)
		    (let ((fields (s-split "," author)))
		      (list (nth 1 fields) (nth 0 fields) year)))
		   ;; first last
		   (t
		    (let ((fields (s-split " " author)))
		      (list (nth 0 fields) (mapconcat 'identity (cdr fields) " ") year))))))))))
  author-strings)
#+END_SRC

#+RESULTS:

#+tblname: collaborators
| firstname  | lastname        | affiliation              | year |
|------------+-----------------+--------------------------+------|
| Erik       | Albenze         | NETL                     | 2014 |
| Shelley    | Anna            | CMU                      | 2015 |
| Federico   | Calle-Vallejo   | Leiden Inst. of Chem.    | 2013 |
| Terrence   | Collins         | CMU                      | 2014 |
| Krishnan   | Damodaran       | UPitt                    | 2014 |
| Carmeline  | Dsilva          | Princeton                | 2012 |
| Adefemi    | Egbebi          | NETL                     | 2015 |
| John       | Eslick          | NETL                     | 2013 |
| Anatoly    | Frenkel         | Yeshiva U.               | 2012 |
| Andrew     | Gellman         | CMU                      | 2015 |
| Kirk       | Gerdes          | NETL                     | 2012 |
| Gamze      | Gumuslu         | CMU                      | 2015 |
| Shayna     | Hilburg         | CMU                      | 2014 |
| David      | Hopkinson       | NETL                     | 2015 |
| Yogesh V.  | Joshi           | Exxon                    | 2015 |
| John       | Keith           | UPitt                    | 2015 |
| Chris      | Keturakis       | Lehigh                   | 2012 |
| Peter      | Kondratyuk      | unknown                  | 2015 |
| Marc T. M. | Koper           | Leiden Inst. of Chem.    | 2013 |
| David      | Luebke          | Lumishield               | 2014 |
| Isabela C. | Man             | unknown                  | 2013 |
| Hari       | Mantripragada   | CMU                      | 2012 |
| James X.   | Mao             | unknown                  | 2013 |
| Aaron      | Marks           | CMU                      | 2012 |
| Jose I.    | Martinez        | unknown                  | 2013 |
| James      | Miller          | U. Wisconsin             | 2015 |
| David      | Miller          | NETL                     | 2013 |
| Bryan      | Morreale        | NETL                     | 2015 |
| Ratiporn   | Munprom         | unknown                  | 2012 |
| Christina  | Myers           | NETL                     | 2015 |
| Hunaid     | Nulwala         | CMU                      | 2015 |
| Rumyana    | Petrova         | unknown                  | 2012 |
| Vladimir   | Pushkarev       | Dow Corning              | 2014 |
| Sumathy    | Raman           | Exxon                    | 2015 |
| Kevin      | Resnik          | NETL                     | 2015 |
| Jan        | Rossmeisl       | DTU                      | 2015 |
| Edward S.  | Rubin           | CMU                      | 2012 |
| Paul       | Salvador        | CMU                      | 2015 |
| Wei        | Shi             | NETL                     | 2014 |
| Nicholas   | Stephen Siefert | NETL                     | 2015 |
| Hai-Yan    | Su              | unknown                  | 2013 |
| Robert L.  | Thompson        | NETL                     | 2014 |
| Relja      | Vasi{\'c}       | Florida State University | 2012 |
| Peter      | Versteeg        | unknown                  | 2012 |
| Israel     | Wachs           | Lehigh                   | 2012 |
| Newell     | Washburn        | CMU                      | 2014 |
| John       | Watkins         | NETL                     | 2015 |
| Chunrong   | Yin             | CMU                      | 2015 |
| Xu         | Zhou            | unknown                  | 2015 |



#+name: list-collaborators
#+BEGIN_SRC emacs-lisp :var data=collaborators
(concat
 (mapconcat
  'identity
  (loop for (fname lname affil year) in data
	with current-year = (string-to-number (format-time-string "%Y"))
        if (stringp year) do (setq year current-year)
	if (> year (- current-year 4))
	collect (format "%s %s (%s)" fname lname affil)) ", ") ".")
#+END_SRC

#+RESULTS: list-collaborators
: Erik Albenze (NETL), Shelley Anna (CMU), Federico Calle-Vallejo (Leiden Inst. of Chem.), Terrence Collins (CMU), Krishnan Damodaran (UPitt), Adefemi Egbebi (NETL), John Eslick (NETL), Andrew Gellman (CMU), Gamze Gumuslu (CMU), Shayna Hilburg (CMU), David Hopkinson (NETL), Yogesh V. Joshi (Exxon), John Keith (UPitt), Peter Kondratyuk (unknown), Marc T. M. Koper (Leiden Inst. of Chem.), David Luebke (Lumishield), Isabela C. Man (unknown), James X. Mao (unknown), Jose I. Martinez (unknown), James Miller (U. Wisconsin), David Miller (NETL), Bryan Morreale (NETL), Christina Myers (NETL), Hunaid Nulwala (CMU), Vladimir Pushkarev (Dow Corning), Sumathy Raman (Exxon), Kevin Resnik (NETL), Jan Rossmeisl (DTU), Paul Salvador (CMU), Wei Shi (NETL), Nicholas Stephen Siefert (NETL), Hai-Yan Su (unknown), Robert L. Thompson (NETL), Newell Washburn (CMU), John Watkins (NETL), Chunrong Yin (CMU), Xu Zhou (unknown).



#+tblname: graduate-students
| Firstname | Lastname     | year | degree | affiliation       |
|-----------+--------------+------+--------+-------------------|
| Sneha     | Akhade       | 2011 | MS     | Penn State        |
| Rich      | Alesi        | 2012 | PhD    | Intel             |
| Robin     | Chao         | 2012 | PhD    | IBM               |
| Mehak     | Chawla       | 2015 | MS     | Dubai             |
| Jing      | Chou         | 2007 | MS     | Taiwan            |
| Matt      | Curnan       | 2015 | PhD    | unknown           |
| Frank     | DeCarlo      | 2010 | MS     | ERC               |
| Ethan     | Demeter      | 2013 | PhD    | FuelCell          |
| Siddhard  | Deshpande    | 2015 | MS     | CMU               |
| Zhizhong  | Ding         | 2012 | MS     | Lousiana State U. |
| Qingqi    | Fan          | 2014 | MS     | unknown           |
| Nitish    | Govindarajan | 2014 | MS     | unknown           |
| Steve     | Illes        | 2014 | MS     | 3M                |
| Nilay     | Inoglu       | 2011 | PhD    | Exxon             |
| James     | Landon       | 2011 | PhD    | CAER              |
| Anita     | Lee          | 2013 | PhD    | Exxon             |
| Yuan      | Li           | 2008 | PD     | Taiwan            |
| Bin       | Liu          | 2013 | PD     | Kansas State U.   |
| Meiheng   | Lu           | 2014 | MS     | unknown           |
| Prateek   | Mehta        | 2013 | MS     | Notre Dame        |
| Spencer   | Miller       | 2011 | PhD    | Combinatorics     |
| Venkatesh | Naik         | 2015 | MS     | unknown           |
| Hari      | Thirumalai   | 2015 | MS     | U. Houston        |
| Vivek     | Vinodan      | 2012 | MS     | unknown           |
| Wenqin    | You          | 2014 | MS     | CMU               |



#+name: list-graduate-students
#+BEGIN_SRC emacs-lisp :var data=graduate-students :results raw
(loop for (fname lname year degree affil) in data
      count (or (string= "MS" degree) (string= "PhD" degree)) into graduate-count
      count (string= "PD" degree) into postdoc-count
      collect (format
	       "%s %s (%s)"
	       fname lname degree)
      into strings
      finally return
      (format "_Thesis Advisor (%s) and Postgraduate-Scholar Sponsor (%s)_: %s."
	      graduate-count postdoc-count
	      (mapconcat 'identity strings ", ")))
#+END_SRC

